<img src="https://pandas.pydata.org/static/img/pandas.svg" width="250">

## <center> Merging DataFrames

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'letter': ['A', 'B', 'C', 'D'],
                    'number': [1, 2, 3, 4]})
df2 = pd.DataFrame({'letter': ['C', 'D', 'E', 'F'],
                    'number': [3, 4, 5, 6]})

### <b> Left Join
<img src="https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/SQL_Join_-_01_A_Left_Join_B.svg/330px-SQL_Join_-_01_A_Left_Join_B.svg.png">

In [3]:
df1.merge(df2,how='left',on='number')

  letter_x  number letter_y
0        A       1      NaN
1        B       2      NaN
2        C       3        C
3        D       4        D

### <b> Inner join
<img src="https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/SQL_Join_-_07_A_Inner_Join_B.svg/330px-SQL_Join_-_07_A_Inner_Join_B.svg.png">

In [4]:
df1.merge(df2,how='inner',left_on='number',right_on='number')
# purpose of having left_on and right_on is because often the 
# columns have different names

  letter_x  number letter_y
0        C       3        C
1        D       4        D

### <b> Right Join
<img src="https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/SQL_Join_-_03_A_Right_Join_B.svg/330px-SQL_Join_-_03_A_Right_Join_B.svg.png">

In [5]:
df1.merge(df2,how='right',on='number',suffixes=('','_right'))

  letter  number letter_right
0      C       3            C
1      D       4            D
2    NaN       5            E
3    NaN       6            F

### Union with `pd.concat`

In [10]:
# drop duplicates with .drop_duplicates()
df3 = pd.concat([df1,df2]).drop_duplicates().reset_index(drop=True)
# df3 = pd.concat([df1, df2]).reset_index(drop=True)
df3

  letter  number
0      A       1
1      B       2
2      C       3
3      D       4
4      E       5
5      F       6

### Concatenate dataframes horizontally

In [11]:
df4 = pd.concat([df1,df2],axis=1)
df4

  letter  number letter  number
0      A       1      C       3
1      B       2      D       4
2      C       3      E       5
3      D       4      F       6

### Append new row to your dataframe

In [12]:
new_row = pd.Series(['Z',26],index=df3.columns)
df3.append(new_row,ignore_index=True)

  letter  number
0      A       1
1      B       2
2      C       3
3      D       4
4      E       5
5      F       6
6      Z      26

### Join along your index

In [13]:
join_df = pd.DataFrame({'letter': ['F','G', 'H', 'I'],
                        'number': [6, 7, 8, 9]})

In [14]:
df2.join(join_df, rsuffix='_right')

  letter  number letter_right  number_right
0      C       3            F             6
1      D       4            G             7
2      E       5            H             8
3      F       6            I             9